let spc2VolumeCarbonCoeffs = {
    "소나무":1.433102488,
    "리기다소나무":1.6674966,
    "잣나무":1.738947408,
    "일본잎갈나무":1.431354293,
    "상수리나무":2.516572392,
    "신갈나무":2.704443742,
    "default":2,
};

let regenerationLaborCoeffs = {
    "소나무":16.64398483,
    "리기다소나무":16.64398483,
    "잣나무":11.50954194,
    "일본잎갈나무":10.75069008,
    "상수리나무":16.1080914,
    "신갈나무":10.9325005,
    "default":15,
};

let regenerationCostCoeffs = {
    "소나무":2040.646114,
    "리기다소나무":2040.646114,
    "잣나무":1682.158649,
    "일본잎갈나무":1909.592305,
    "상수리나무":2745.327768,
    "신갈나무":1788.391829,
    "default":2000,
};

let spc2VolumePriceCoeffs = {
    thinning:{
        "소나무":64208.874,
        "리기다소나무":43227,
        "잣나무":67373,
        "일본잎갈나무":79176,
        "상수리나무":46780,
        "신갈나무":46780,
        "default":50000,
    },
    clearCut:{
        "소나무":99121,
        "리기다소나무":32859,
        "잣나무":53758,
        "일본잎갈나무":68905,
        "상수리나무":19042,
        "신갈나무":19042,
        "default":70000,
    }
};
let volume2Price = {
    thinning:{
        O:64208.874,
        C:43227,
        K:67373,
        L:79176,
        S:46780,
        B:46780,
    },
    clearCut:{
        O:99121,
        C:32859.01,
        K:53758,
        L:68905,
        S:19042,
        B:19042,
    },
};

let CO2ProcessingCost = 50; // $달러
let exchangeRate = 1200; // 원-달러 환율
let waterSavingCoeff = 959.91 // 수자원함양가치 (Won/ton)

let interestRate = 0.015;
var NPV = function(r, t) { // t는 분기 단위로 입력
    return 1 / Math.pow(1 + r, 10*t-5);
}




